
&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	ЭтаФорма.ВыбраннаяДата = ЭтаФорма.Календарь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	   ЭтаФорма.Календарь = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМероприятиеНаСервере(Сотрудник, Дата, Мероприятие, ОписаниеМероприятия)
	Менеджер = Сотрудник.ПолучитьОбъект();
	Событие = Менеджер.РасписаниеДня.Добавить();
	Событие.Дата = Дата;
	Событие.Мероприятие = Мероприятие;
	Событие.ОписаниеМероприятия = ОписаниеМероприятия;
	Менеджер.Записать();
	Сообщить("Мероприятие добавлено")
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМероприятие(Команда)
	Если ПустаяСтрока(ЭтаФорма.Сотрудник) Тогда
		
		ПоказатьПредупреждение(,"Введите Сотрудника",,"Ошибка");
	ИначеЕсли ЭтаФорма.ВыбраннаяДата = Дата('00010101') Тогда
		ПоказатьПредупреждение(,"Введите Дату",,"Ошибка");
	ИначеЕсли ПустаяСтрока(ЭтаФорма.Мероприятие) Тогда
		ПоказатьПредупреждение(,"Введите Мероприятие",,"Ошибка");
	Иначе
	ДобавитьМероприятиеНаСервере(ЭтаФорма.Сотрудник, ЭтаФорма.ВыбраннаяДата, ЭтаФорма.Мероприятие, ЭтаФорма.ОписаниеМероприятия);
	ЭтаФорма.ВыбраннаяДата=Дата('00010101');
	ЭтаФорма.Мероприятие = "";
	ЭтаФорма.Сотрудник = "";
	ЭтаФорма.ОписаниеМероприятия = "";
	КонецЕсли;

КонецПроцедуры

