
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	Стиль = Константы.ТекущийСтиль.Получить();
	Если Стиль = Перечисления.Стили.Желтый Тогда
		ГлавныйСтиль = БиблиотекаСтилей["Желтый"];
	ИначеЕсли Стиль = Перечисления.Стили.Зеленый Тогда
		ГлавныйСтиль = БиблиотекаСтилей["Зеленый"];
	ИначеЕсли Стиль = Перечисления.Стили.Синий Тогда
		ГлавныйСтиль = БиблиотекаСтилей["Синий"];
	ИначеЕсли Стиль = Перечисления.Стили.Красный Тогда
		ГлавныйСтиль = БиблиотекаСтилей["Красный"];
	ИначеЕсли Стиль = Перечисления.Стили.Фиолетовый Тогда
		ГлавныйСтиль = БиблиотекаСтилей["Фиолетовый"];
	КонецЕсли;
	
		
КонецПроцедуры
