&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПустаяСтрока(Объект.Фамилия) Тогда
		СообщитьПользователю("Объект.Фамилия", "Заполните поле Фамилия", Отказ);
	КонецЕсли;
	Если ПустаяСтрока(Объект.Имя) Тогда
		СообщитьПользователю("Объект.Имя", "Заполните поле Имя", Отказ);
	КонецЕсли;
	Если ПустаяСтрока(Объект.Отчество) Тогда
		СообщитьПользователю("Объект.Отчество", "Заполните поле Отчество", Отказ);
	КонецЕсли;
	Если НЕ Отказ Тогда
		Объект.Наименование=Объект.Фамилия+" "+ВРег(Лев(Объект.Имя,1))+". "+ВРег(Лев(Объект.Отчество,1))+".";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователю(ПутьКРеквизиту, Текст, Отказ)
	Сообщение=Новый СообщениеПользователю;
	Сообщение.Поле=ПутьКРеквизиту;
	Сообщение.Текст=Текст;
	Сообщение.Сообщить();
	Отказ=Истина;
КонецПроцедуры



&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	УстановитьЗарплату();
КонецПроцедуры


&НаСервере
Процедура УстановитьЗарплату()
	Объект.Зарплата=Объект.Должность.Зарплата;
КонецПроцедуры
