
&НаКлиенте
Процедура ПоискДолжности(Команда)
	Параметр = Новый Структура("Ключ", ПоискДолжностиНаСервере());
	Форма = ПолучитьФорму("Справочник.Должности.Форма.ФормаЭлемента", Параметр);
	Форма.Открыть();
КонецПроцедуры
&НаСервере
Функция ПоискДолжностиНаСервере()
	Возврат Справочники.Должности.НайтиПоНаименованию(Должность);
КонецФункции

&НаКлиенте
Процедура ПоискОтдела(Команда)
	Параметр = Новый Структура("Ключ", ПоискОтделаНаСервере());
	Форма = ПолучитьФорму("Справочник.Отделы.Форма.ФормаЭлемента", Параметр);
	Форма.Открыть();
КонецПроцедуры
&НаСервере
Функция ПоискОтделаНаСервере()
	Возврат Справочники.Отделы.НайтиПоНаименованию(Отдел);
КонецФункции


&НаКлиенте
Процедура ПоискСотрудника(Команда)
	Параметр = Новый Структура("Ключ", ПоискСотрудникаНаСервере());
	Форма = ПолучитьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", Параметр);
	Форма.Открыть();
КонецПроцедуры
&НаСервере
Функция ПоискСотрудникаНаСервере()
	Возврат Справочники.Сотрудники.НайтиПоНаименованию(Сотрудник);
КонецФункции


